In [2]:
import pandas as pd
india_weather=pd.DataFrame({"city":["mumbai","delhi","banglore"],"temp":[32,45,30],"humid":[80,60,78]})
india_weather

       city  temp  humid
0    mumbai    32     80
1     delhi    45     60
2  banglore    30     78

In [3]:
us_weather=pd.DataFrame({"city":["New york","chicago","orlando"],"temp":[21,14,35],"humid":[68,65,75]})
us_weather

       city  temp  humid
0  New york    21     68
1   chicago    14     65
2   orlando    35     75

In [33]:
##concats by continuous values
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

       city  temp  humid
0    mumbai    32     80
1     delhi    45     60
2  banglore    30     78
3  New york    21     68
4   chicago    14     65
5   orlando    35     75

In [37]:
df=pd.concat([india_weather,us_weather],keys=["india","us"])

In [38]:
df

             city  temp  humid
india 0    mumbai    32     80
      1     delhi    45     60
      2  banglore    30     78
us    0  New york    21     68
      1   chicago    14     65
      2   orlando    35     75

In [9]:
df.loc["india"]

       city  temp  humid
0    mumbai    32     80
1     delhi    45     60
2  banglore    30     78

In [10]:
df.loc["us"]

       city  temp  humid
0  New york    21     68
1   chicago    14     65
2   orlando    35     75

In [12]:
temperature_df=pd.DataFrame({"city":["mumbai","delhi","banglore"],"temp":[32,45,30]},index=[0,1,2])
temperature_df

       city  temp
0    mumbai    32
1     delhi    45
2  banglore    30

In [19]:
windspeed_df=pd.DataFrame({"city":["delhi","mumbai"],"windspeed":[7,12]},index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [18]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temp    city  windspeed
0    mumbai    32   delhi        7.0
1     delhi    45  mumbai       12.0
2  banglore    30     NaN        NaN

In [20]:
##mapped by changing index
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temp    city  windspeed
0    mumbai    32  mumbai       12.0
1     delhi    45   delhi        7.0
2  banglore    30     NaN        NaN

In [21]:
##concating by series
s=pd.Series(["humid","dry","rain"],name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [22]:
df=pd.concat([temperature_df,s],axis=1)
df

       city  temp  event
0    mumbai    32  humid
1     delhi    45    dry
2  banglore    30   rain

In [28]:
df.set_index('city',inplace=True)
df

          temp  event
city
mumbai      32  humid
delhi       45    dry
banglore    30   rain

In [30]:
df.reset_index(inplace=True)
df

       city  temp  event
0    mumbai    32  humid
1     delhi    45    dry
2  banglore    30   rain

In [43]:
sravya_df=pd.DataFrame({"a":["chandu","radhi","sravs"],"b":[5,4,1],"c":["good","bad","v.bad"]})
sravya_df

        a  b      c
0  chandu  5   good
1   radhi  4    bad
2   sravs  1  v.bad

In [45]:
gowrakhi_df=pd.DataFrame({"3akkas":["chandu","sravs","radhi"],"gift_no":['urwish','3','2'],"lw_1":["fossil","diesel","chairos"],"lw2":["iphone","1+","1-"]})
gowrakhi_df

   3akkas gift_no     lw_1     lw2
0  chandu  urwish   fossil  iphone
1   sravs       3   diesel      1+
2   radhi       2  chairos      1-

In [48]:
b_dates=pd.Series(["02/oct","05/nov","28/oct"],name='dob')
b_dates

0    02/oct
1    05/nov
2    28/oct
Name: dob, dtype: object

In [52]:
c_df=pd.concat([gowrakhi_df,b_dates],axis=1)
c_df

   3akkas gift_no     lw_1     lw2     dob
0  chandu  urwish   fossil  iphone  02/oct
1   sravs       3   diesel      1+  05/nov
2   radhi       2  chairos      1-  28/oct